app/Controllers/Home.php

SELECT *
FROM `products`
---
    public function index(): string
    {
        $productModel = new ProductModel();
        $products = $productModel->findAll();