app/Models/CategoryModel.php

    public function getAllCate()
    {
        return $this->findAll();
---
SELECT *
FROM `categories`