app/Models/ProductModel.php

INSERT INTO `products` (`name`, `image`, `price`, `description`, `category_id`) VALUES ('Spaceman', 'uploads/1735739685_7ee8f7434216b1c86303.jpg', '456776', 'the des', '1')
---
    public function createProduct(array $data)
    {
        return $this->insert($data);

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
---
    public function getAllProducts()
    {
        return $this->join('category', 'product.category_id = category.id')
        ->select('product.*, category.name AS category_name')
        ->get()
        ->getResultArray();

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`id` = '3'
---
    public function getProductById($id)
    {
        return $this->join('category', 'product.category_id = category.id')
        ->select('product.*, category.name AS category_name')
        ->where('product.id', $id)
        ->get()
        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function countProduct()
    {
        return $this->countAllResults();