app/Models/UserModel.php

    public function checkUser($email)
    {
       return $this->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'plutospaceman22@gmail.com'
 LIMIT 1

    public function countUser()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function addUser($data)
    {
        return $this->insert($data);
---
INSERT INTO `user` (`name`, `email`, `password`, `address`) VALUES ('joshua webprowale', 'plutospaceman22@gmail.com', '$2y$10$jjXb92o2vqcRACUbFB/e8e9qjVH3ML7STTVni9w0sf5yG/kqlL7g.', '2, Oduduwa Street,Ile-Ife.')